Autodesk.Revit.DB.FabricationOptionDefinition.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.FabricationOptionDefinition.IsModifiable
Checks if the fabrication option is modifiable by user.
Since:
2027

Autodesk.Revit.DB.FabricationOptionDefinition.Name
Fabrication option name.
Since:
2027

Autodesk.Revit.DB.FabricationOptionDefinition
Represents a single fabrication pattern option definition.
Since:
2027